espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ledc_eco5_struct.h
/** Group: Version Register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** ledc_date : R/W; bitpos: [27:0]; default: 37765152;
         *  Configures the version.
         */
        uint32_t ledc_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} ledc_date_reg_t;


typedef struct {
    volatile ledc_chn_conf0_reg_t ch0_conf0;
    volatile ledc_chn_hpoint_reg_t ch0_hpoint;
    volatile ledc_chn_duty_reg_t ch0_duty;
    volatile ledc_chn_conf1_reg_t ch0_conf1;
    volatile ledc_chn_duty_r_reg_t ch0_duty_r;
    volatile ledc_chn_conf0_reg_t ch1_conf0;
    volatile ledc_chn_hpoint_reg_t ch1_hpoint;
    volatile ledc_chn_duty_reg_t ch1_duty;
    volatile ledc_chn_conf1_reg_t ch1_conf1;
    volatile ledc_chn_duty_r_reg_t ch1_duty_r;
    volatile ledc_chn_conf0_reg_t ch2_conf0;
    volatile ledc_chn_hpoint_reg_t ch2_hpoint;
    volatile ledc_chn_duty_reg_t ch2_duty;
    volatile ledc_chn_conf1_reg_t ch2_conf1;
    volatile ledc_chn_duty_r_reg_t ch2_duty_r;
    volatile ledc_chn_conf0_reg_t ch3_conf0;
    volatile ledc_chn_hpoint_reg_t ch3_hpoint;
    volatile ledc_chn_duty_reg_t ch3_duty;
    volatile ledc_chn_conf1_reg_t ch3_conf1;
    volatile ledc_chn_duty_r_reg_t ch3_duty_r;
    volatile ledc_chn_conf0_reg_t ch4_conf0;
    volatile ledc_chn_hpoint_reg_t ch4_hpoint;
    volatile ledc_chn_duty_reg_t ch4_duty;
    volatile ledc_chn_conf1_reg_t ch4_conf1;
    volatile ledc_chn_duty_r_reg_t ch4_duty_r;
    volatile ledc_chn_conf0_reg_t ch5_conf0;
    volatile ledc_chn_hpoint_reg_t ch5_hpoint;
    volatile ledc_chn_duty_reg_t ch5_duty;
    volatile ledc_chn_conf1_reg_t ch5_conf1;
    volatile ledc_chn_duty_r_reg_t ch5_duty_r;
    volatile ledc_chn_conf0_reg_t ch6_conf0;
    volatile ledc_chn_hpoint_reg_t ch6_hpoint;
    volatile ledc_chn_duty_reg_t ch6_duty;
    volatile ledc_chn_conf1_reg_t ch6_conf1;
    volatile ledc_chn_duty_r_reg_t ch6_duty_r;
    volatile ledc_chn_conf0_reg_t ch7_conf0;
    volatile ledc_chn_hpoint_reg_t ch7_hpoint;
    volatile ledc_chn_duty_reg_t ch7_duty;
    volatile ledc_chn_conf1_reg_t ch7_conf1;
    volatile ledc_chn_duty_r_reg_t ch7_duty_r;
    volatile ledc_timern_conf_reg_t timer0_conf;
    volatile ledc_timern_value_reg_t timer0_value;
    volatile ledc_timern_conf_reg_t timer1_conf;
    volatile ledc_timern_value_reg_t timer1_value;
    volatile ledc_timern_conf_reg_t timer2_conf;
    volatile ledc_timern_value_reg_t timer2_value;
    volatile ledc_timern_conf_reg_t timer3_conf;
    volatile ledc_timern_value_reg_t timer3_value;
    volatile ledc_int_raw_reg_t int_raw;
    volatile ledc_int_st_reg_t int_st;
    volatile ledc_int_ena_reg_t int_ena;
    volatile ledc_int_clr_reg_t int_clr;
    uint32_t reserved_0d0[12];
    volatile ledc_chn_gamma_conf_reg_t chn_gamma_conf[8];
    volatile ledc_evt_task_en0_reg_t evt_task_en0;
    volatile ledc_evt_task_en1_reg_t evt_task_en1;
    volatile ledc_evt_task_en2_reg_t evt_task_en2;
    uint32_t reserved_12c[5];
    volatile ledc_timern_cmp_reg_t timern_cmp[4];
    volatile ledc_timern_cnt_cap_reg_t timern_cnt_cap[4];
    uint32_t reserved_160[4];
    volatile ledc_conf_reg_t conf;
    volatile ledc_date_reg_t date;
} ledc_dev_t;

extern ledc_dev_t LEDC;

#ifndef __cplusplus
_Static_assert(sizeof(ledc_dev_t) == 0x178, "Invalid size of ledc_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
